; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v12 ?v6)
             (pred_1 ?v2 ?v7)
             (pred_10 ?v12 ?v7)
             (pred_7 ?v4 ?v12 )
	     (pred_4 ?v12)
             (pred_9 ?v10)
             (pred_2 ?v2)
             (pred_6 ?v7)
             (pred_11 ?v12)
             (pred_12 ?v2)
             (pred_5 ?v12)
             (pred_3 ))



(:action op_5
:parameters (?v5 ?v13 ?v11 ?v1)
:precondition (and (pred_9 ?v5) (pred_9 ?v13) (pred_2 ?v11) (pred_6 ?v1)
          (pred_8 ?v5 ?v13) (pred_1 ?v11 ?v1)
                   (pred_10 ?v13 ?v1) (pred_4 ?v5) 
                   (pred_11 ?v13) (pred_12 ?v11))
:effect (and  (pred_5 ?v13) (not (pred_11 ?v13))))


(:action op_2
:parameters (?v5 ?v9)
:precondition (and (pred_9 ?v5) (pred_9 ?v9)
               (pred_4 ?v5) (pred_8 ?v5 ?v9) (pred_5 ?v9))
:effect (and (pred_4 ?v9) (not (pred_4 ?v5))))

(:action op_1
:parameters (?v5 ?v11)
:precondition (and (pred_9 ?v5) (pred_2 ?v11) 
                  (pred_4 ?v5) (pred_7 ?v11 ?v5) (pred_3 ))
:effect (and (pred_12 ?v11)
   (not (pred_7 ?v11 ?v5)) (not (pred_3 ))))


(:action op_3
:parameters (?v5 ?v8 ?v3)
:precondition (and (pred_9 ?v5) (pred_2 ?v8) (pred_2 ?v3)
                  (pred_4 ?v5) (pred_12 ?v3) (pred_7 ?v8 ?v5))
:effect (and (pred_12 ?v8) (pred_7 ?v3 ?v5)
        (not (pred_12 ?v3)) (not (pred_7 ?v8 ?v5))))

(:action op_4
:parameters (?v5 ?v11)
:precondition (and (pred_9 ?v5) (pred_2 ?v11) 
                  (pred_4 ?v5) (pred_12 ?v11))
:effect (and (pred_3 ) (pred_7 ?v11 ?v5) (not (pred_12 ?v11)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_29 obj_12 obj_25 obj_26 obj_15 obj_27 obj_19 obj_09 obj_28 obj_20 obj_08 obj_23 obj_05 obj_06 obj_17 obj_04 obj_31 obj_07 obj_22 obj_14 obj_01 obj_11 obj_02 obj_03 obj_16
    obj_13 obj_18 obj_30
    obj_21 obj_10 obj_24
    )

    (:init
       (pred_3)

       (pred_9 obj_29)
       (pred_9 obj_12)
       (pred_9 obj_25)
       (pred_9 obj_26)
       (pred_9 obj_15)
       (pred_9 obj_27)
       (pred_9 obj_19)
       (pred_9 obj_09)
       (pred_9 obj_28)
       (pred_9 obj_20)
       (pred_9 obj_08)
       (pred_9 obj_23)
       (pred_9 obj_05)
       (pred_9 obj_06)
       (pred_9 obj_17)
       (pred_9 obj_04)
       (pred_9 obj_31)
       (pred_9 obj_07)
       (pred_9 obj_22)
       (pred_9 obj_14)
       (pred_9 obj_01)
       (pred_9 obj_11)
       (pred_9 obj_02)
       (pred_9 obj_03)
       (pred_9 obj_16)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_30)
       (pred_2 obj_21)
       (pred_2 obj_10)
       (pred_2 obj_24)

       (pred_8 obj_29 obj_27)
       (pred_8 obj_29 obj_12)
       (pred_8 obj_12 obj_19)
       (pred_8 obj_12 obj_25)
       (pred_8 obj_12 obj_29)
       (pred_8 obj_25 obj_09)
       (pred_8 obj_25 obj_26)
       (pred_8 obj_25 obj_12)
       (pred_8 obj_26 obj_28)
       (pred_8 obj_26 obj_15)
       (pred_8 obj_26 obj_25)
       (pred_8 obj_15 obj_20)
       (pred_8 obj_15 obj_26)
       (pred_8 obj_27 obj_08)
       (pred_8 obj_27 obj_19)
       (pred_8 obj_27 obj_29)
       (pred_8 obj_19 obj_23)
       (pred_8 obj_19 obj_09)
       (pred_8 obj_19 obj_12)
       (pred_8 obj_19 obj_27)
       (pred_8 obj_09 obj_05)
       (pred_8 obj_09 obj_28)
       (pred_8 obj_09 obj_25)
       (pred_8 obj_09 obj_19)
       (pred_8 obj_28 obj_06)
       (pred_8 obj_28 obj_20)
       (pred_8 obj_28 obj_26)
       (pred_8 obj_28 obj_09)
       (pred_8 obj_20 obj_17)
       (pred_8 obj_20 obj_15)
       (pred_8 obj_20 obj_28)
       (pred_8 obj_08 obj_04)
       (pred_8 obj_08 obj_23)
       (pred_8 obj_08 obj_27)
       (pred_8 obj_23 obj_31)
       (pred_8 obj_23 obj_05)
       (pred_8 obj_23 obj_19)
       (pred_8 obj_23 obj_08)
       (pred_8 obj_05 obj_07)
       (pred_8 obj_05 obj_06)
       (pred_8 obj_05 obj_09)
       (pred_8 obj_05 obj_23)
       (pred_8 obj_06 obj_22)
       (pred_8 obj_06 obj_17)
       (pred_8 obj_06 obj_28)
       (pred_8 obj_06 obj_05)
       (pred_8 obj_17 obj_14)
       (pred_8 obj_17 obj_20)
       (pred_8 obj_17 obj_06)
       (pred_8 obj_04 obj_01)
       (pred_8 obj_04 obj_31)
       (pred_8 obj_04 obj_08)
       (pred_8 obj_31 obj_11)
       (pred_8 obj_31 obj_07)
       (pred_8 obj_31 obj_23)
       (pred_8 obj_31 obj_04)
       (pred_8 obj_07 obj_02)
       (pred_8 obj_07 obj_22)
       (pred_8 obj_07 obj_05)
       (pred_8 obj_07 obj_31)
       (pred_8 obj_22 obj_03)
       (pred_8 obj_22 obj_14)
       (pred_8 obj_22 obj_06)
       (pred_8 obj_22 obj_07)
       (pred_8 obj_14 obj_16)
       (pred_8 obj_14 obj_17)
       (pred_8 obj_14 obj_22)
       (pred_8 obj_01 obj_11)
       (pred_8 obj_01 obj_04)
       (pred_8 obj_11 obj_02)
       (pred_8 obj_11 obj_31)
       (pred_8 obj_11 obj_01)
       (pred_8 obj_02 obj_03)
       (pred_8 obj_02 obj_07)
       (pred_8 obj_02 obj_11)
       (pred_8 obj_03 obj_16)
       (pred_8 obj_03 obj_22)
       (pred_8 obj_03 obj_02)
       (pred_8 obj_16 obj_14)
       (pred_8 obj_16 obj_03)
       (pred_11 obj_05)
       (pred_11 obj_14)
       (pred_11 obj_28)
       (pred_10  obj_05 obj_13)
       (pred_10  obj_14 obj_18)
       (pred_10  obj_28 obj_30)
       (pred_5 obj_29)
       (pred_5 obj_12)
       (pred_5 obj_25)
       (pred_5 obj_26)
       (pred_5 obj_15)
       (pred_5 obj_27)
       (pred_5 obj_19)
       (pred_5 obj_09)
       (pred_5 obj_20)
       (pred_5 obj_08)
       (pred_5 obj_23)
       (pred_5 obj_06)
       (pred_5 obj_17)
       (pred_5 obj_04)
       (pred_5 obj_31)
       (pred_5 obj_07)
       (pred_5 obj_22)
       (pred_5 obj_01)
       (pred_5 obj_11)
       (pred_5 obj_02)
       (pred_5 obj_03)
       (pred_5 obj_16)

       (pred_1  obj_21 obj_13)
       (pred_1  obj_10 obj_18)
       (pred_1  obj_24 obj_30)
       (pred_7 obj_21 obj_19)
       (pred_7 obj_10 obj_01)
       (pred_7 obj_24 obj_09)
       (pred_4 obj_03)
    )

    (:goal (and
       (pred_7 obj_24 obj_04)
    ))
(:constraints
  (always (not (pred_4 obj_08)))
)
)

; plan
1. (op_2 obj_03 obj_22)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_22)
   goals met: 0 of 1
2. (op_2 obj_22 obj_07)
   deleted: (pred_4 obj_22)
   added: (pred_4 obj_07)
   goals met: 0 of 1
3. (op_2 obj_07 obj_31)
   deleted: (pred_4 obj_07)
   added: (pred_4 obj_31)
   goals met: 0 of 1
4. (op_2 obj_31 obj_23)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_23)
   goals met: 0 of 1
5. (op_2 obj_23 obj_19)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_19)
   goals met: 0 of 1
6. (op_2 obj_19 obj_09)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_09)
   goals met: 0 of 1
7. (op_1 obj_09 obj_24)
   deleted: (pred_7 obj_24 obj_09) (pred_3)
   added: (pred_12 obj_24)
   goals met: 0 of 1
8. (op_2 obj_09 obj_19)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_19)
   goals met: 0 of 1
9. (op_2 obj_19 obj_23)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_23)
   goals met: 0 of 1
10. (op_2 obj_23 obj_31)
   deleted: (pred_4 obj_23)
   added: (pred_4 obj_31)
   goals met: 0 of 1
11. (op_2 obj_31 obj_04)
   deleted: (pred_4 obj_31)
   added: (pred_4 obj_04)
   goals met: 0 of 1
12. (op_4 obj_04 obj_24)
   deleted: (pred_12 obj_24)
   added: (pred_3) (pred_7 obj_24 obj_04)
   goals met: 1 of 1
